#### SetCellCalculatedValue Method (Int32, TableCellCalculatedValueData)

---

|  |
| --- |
| TableSectionData Class   See Also |

Allows the caller to set the calculated value for a specified column

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetCellCalculatedValue( 	int nCol, 	TableCellCalculatedValueData pCalcValue ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCellCalculatedValue ( _ 	nCol As Integer, _ 	pCalcValue As TableCellCalculatedValueData _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCellCalculatedValue( 	int nCol,  	TableCellCalculatedValueData^ pCalcValue ) ``` |

#### Parameters

nCol
:   Type:  System Int32

pCalcValue
:   Type:  Autodesk.Revit.DB TableCellCalculatedValueData

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This operation is forbidden for cells in standard schedule header sections. -or- This operation is forbidden for cells in standard schedule body sections. |

# See Also

TableSectionData Class

SetCellCalculatedValue Overload

Autodesk.Revit.DB Namespace